---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetTableData
source: html/0e1fec60-7429-5eba-b2a4-25ac0439e3c5.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleTemplate.GetTableData Method

Gets the writable table data object.

## Syntax (C#)
```csharp
public PanelScheduleData GetTableData()
```

## Returns
The panel schedule data object.

## Remarks
Access to this information requires an open transaction.